app/views/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 18
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = 18
---
<ul>
	<% if @post.comments.any? %>