app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY created_at DESC
---
	def index
		@posts = Post.all(:order => 'created_at DESC')

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 18
---
	def show
		@post = Post.find(params[:id])
		@comment = Post.find(params[:id]).comments.build

INSERT INTO "posts" ("content", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["content", "追加テスト"], ["created_at", Mon, 27 Jan 2014 17:21:37 UTC +00:00], ["title", "タイトルてすと"], ["updated_at", Mon, 27 Jan 2014 17:21:37 UTC +00:00]]
---
	def create
		@post = Post.new(params[:post])

		if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "10"]]
UPDATE "posts" SET "content" = 'ああああああああ
---
 	def update
 		@post = Post.find(params[:id])
 		if @post.update_attributes(params[:post])